## Terraform `services`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>


```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.api-comments.aws_ecs_service.service will be updated in-place
  ~ resource "aws_ecs_service" "service" {
        id                                 = "arn:aws:ecs:us-east-1:685496751393:service/dev/api-comments"
        name                               = "api-comments"
        tags                               = {
            "Name"    = "api-comments.service.dev.desafio"
            "Service" = "api-comments"
        }
      ~ task_definition                    = "api-comments:5" -> (known after apply)
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api-comments.aws_ecs_task_definition.task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "task_definition" {
      ~ arn                      = "arn:aws:ecs:us-east-1:685496751393:task-definition/api-comments:3" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:685496751393:task-definition/api-comments" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - environment      = []
                  ~ image            = "685496751393.dkr.ecr.us-east-1.amazonaws.com/api-comments:latest" -> "685496751393.dkr.ecr.us-east-1.amazonaws.com/api-comments:017bb53"
                    name             = "api-comments"
                    # (10 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "api-comments" -> (known after apply)
      ~ revision                 = 3 -> (known after apply)
        tags                     = {
            "Name"    = "api-comments.task.dev.desafio"
            "Service" = "api-comments"
        }
        # (9 unchanged attributes hidden)
    }

  # module.api-comments.aws_security_group.ecs_security_group will be updated in-place
  ~ resource "aws_security_group" "ecs_security_group" {
        id                     = "sg-07d921a2b9a4db63d"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "From Load Balancer"
              - from_port        = 8000
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-02cdc4b5fd6708092",
                ]
              - self             = false
              - to_port          = 8000
            },
          - {
              - cidr_blocks      = []
              - description      = "From Load Balancer"
              - from_port        = 8000
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-084b512ff7c8cb285",
                ]
              - self             = false
              - to_port          = 8000
            },
            # (1 unchanged element hidden)
        ]
        name                   = "dev-api-comments-sg"
        tags                   = {
            "Name"    = "api-comments.securitygroup.dev.desafio"
            "Service" = "api-comments"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```

</details>

*Pusher: @sidneiweber, Action: `pull_request`*